 #==============================================================================
# ■ デジタルタイマー ver 1.00 莞爾の草
#==============================================================================
# 　タイマーの文字をデジタル時計風のものに置換します。
# Graphics/Systemの中のdigitalNumという名前の画像（png/jpg/jpeg）形式の
# 画像を文字盤として使います。
# 　文字盤の画像は等角で「0123456789:」という順番で描いてください。
# 一文字の幅は整数であること以外指定はありません。
#==============================================================================
class Sprite_Timer
  #--------------------------------------------------------------------------
  # ● タイマーの文字数
  #--------------------------------------------------------------------------
  def timer_length
    return 5
  end
  #--------------------------------------------------------------------------
  # ● ビットマップの作成
  #--------------------------------------------------------------------------
  def create_bitmap
    @digital_bitmap = Cache.system("digitalNum")
    @diginum_width = @digital_bitmap.width / 11
    self.bitmap = Bitmap.new(@diginum_width * timer_length, @digital_bitmap.height)
  end
  #--------------------------------------------------------------------------
  # ● 再描画
  #--------------------------------------------------------------------------
  def redraw
    self.bitmap.clear
    text = timer_text
    rect = Rect.new(0, 0, @diginum_width, @digital_bitmap.height)
    timer_length.times do |i|
      rect.x = (text[i] == ?: ? 10 : text[i].to_i) * @diginum_width
      self.bitmap.blt(@diginum_width * i, 0, @digital_bitmap, rect)
    end
  end
  #--------------------------------------------------------------------------
  # ● 位置の更新
  #--------------------------------------------------------------------------
  def update_position
    self.x = Graphics.width - self.bitmap.width - 8
    self.y = 5
    self.z = 200
  end
  #--------------------------------------------------------------------------
  # ● 解放
  #--------------------------------------------------------------------------
  alias digtimer_dispose dispose
  def dispose
    @digital_bitmap.dispose
    digtimer_dispose
  end
end
